<a href="https://colab.research.google.com/github/Vikas-1093/Data-science/blob/main/23_Chapter_7_Data_Cleaning_and_Preparation_code_completed.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [40]:
import pandas as pd
import numpy as np

# **Handling Missing Data**

In [ ]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [ ]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [ ]:
string_data[0] = None

In [ ]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

**Filtering Out Missing Data**

In [ ]:
from numpy import nan as NA

In [ ]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [ ]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
...:                     [NA, NA, NA], [NA, 6.5, 3.]])

In [ ]:
cleaned = data.dropna()

In [ ]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [ ]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
data[4] = NA

In [ ]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [ ]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
df = pd.DataFrame(np.random.randn(7, 3))

In [ ]:
df.iloc[:4, 1] = NA

In [ ]:
df.iloc[:2, 2] = NA

In [ ]:
df

          0         1         2
0  1.014348       NaN       NaN
1 -1.031359       NaN       NaN
2 -0.478219       NaN  0.001901
3 -0.601412       NaN  0.935506
4  0.141575  1.831507 -0.223781
5  1.755378  0.326890 -2.019358
6  0.818176 -0.917078 -0.971411

In [ ]:
df.dropna()

          0         1         2
4  0.141575  1.831507 -0.223781
5  1.755378  0.326890 -2.019358
6  0.818176 -0.917078 -0.971411

In [ ]:
df.dropna(thresh=2)

          0         1         2
2 -0.478219       NaN  0.001901
3 -0.601412       NaN  0.935506
4  0.141575  1.831507 -0.223781
5  1.755378  0.326890 -2.019358
6  0.818176 -0.917078 -0.971411

**Filling In Missing Data**

In [ ]:
df.fillna(0)

          0         1         2
0  1.014348  0.000000  0.000000
1 -1.031359  0.000000  0.000000
2 -0.478219  0.000000  0.001901
3 -0.601412  0.000000  0.935506
4  0.141575  1.831507 -0.223781
5  1.755378  0.326890 -2.019358
6  0.818176 -0.917078 -0.971411

In [ ]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.014348  0.500000  0.000000
1 -1.031359  0.500000  0.000000
2 -0.478219  0.500000  0.001901
3 -0.601412  0.500000  0.935506
4  0.141575  1.831507 -0.223781
5  1.755378  0.326890 -2.019358
6  0.818176 -0.917078 -0.971411

In [ ]:
_ = df.fillna(0, inplace=True)

In [ ]:
df

          0         1         2
0  1.014348  0.000000  0.000000
1 -1.031359  0.000000  0.000000
2 -0.478219  0.000000  0.001901
3 -0.601412  0.000000  0.935506
4  0.141575  1.831507 -0.223781
5  1.755378  0.326890 -2.019358
6  0.818176 -0.917078 -0.971411

In [ ]:
df = pd.DataFrame(np.random.randn(6, 3))

In [ ]:
df.iloc[2:, 1] = NA

In [ ]:
df.iloc[4:, 2] = NA

In [ ]:
df

          0         1         2
0  0.452117 -0.827870  0.673380
1  0.784668 -2.183754 -0.855665
2  1.991612       NaN -0.999486
3 -0.020973       NaN  0.970507
4 -0.287883       NaN       NaN
5  0.004799       NaN       NaN

In [ ]:
df.fillna(method='ffill')

          0         1         2
0  0.452117 -0.827870  0.673380
1  0.784668 -2.183754 -0.855665
2  1.991612 -2.183754 -0.999486
3 -0.020973 -2.183754  0.970507
4 -0.287883 -2.183754  0.970507
5  0.004799 -2.183754  0.970507

In [ ]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.452117 -0.827870  0.673380
1  0.784668 -2.183754 -0.855665
2  1.991612 -2.183754 -0.999486
3 -0.020973 -2.183754  0.970507
4 -0.287883       NaN  0.970507
5  0.004799       NaN  0.970507

In [ ]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [ ]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

**Data Transformation**

  **Removing Duplicates**

In [ ]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
....: 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [ ]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [ ]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [ ]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [ ]:
data['v1'] = range(7)

In [ ]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [ ]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

**Transforming Data Using a Function or Mapping**

In [ ]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
....: 'Pastrami', 'corned beef', 'Bacon',
....: 'pastrami', 'honey ham', 'nova lox'],
....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [ ]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [ ]:
lowercased = data['food'].str.lower()

In [ ]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [ ]:
data['animal'] = lowercased.map(meat_to_animal)

In [ ]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [ ]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

**Replacing Values**

In [ ]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [ ]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [ ]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [ ]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

**Renaming Axis Indexes**

In [ ]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
....: index=['Ohio', 'Colorado', 'New York'],
....: columns=['one', 'two', 'three', 'four'])

In [ ]:
transform = lambda x: x[:4].upper()

In [ ]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [ ]:
data.index = data.index.map(transform)

In [ ]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [ ]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [ ]:
data.rename(index={'OHIO': 'INDIANA'},
....: columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [ ]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

**Discretization and Binning**

In [ ]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [ ]:
bins = [18, 25, 35, 60, 100]

In [ ]:
cats = pd.cut(ages, bins)

In [ ]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [ ]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [ ]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [ ]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [ ]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [ ]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [ ]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [ ]:
data = np.random.rand(20)

In [ ]:
pd.cut(data, 4, precision=2)

[(0.69, 0.9], (0.071, 0.28], (0.28, 0.49], (0.69, 0.9], (0.49, 0.69], ..., (0.071, 0.28], (0.49, 0.69], (0.071, 0.28], (0.69, 0.9], (0.49, 0.69]]
Length: 20
Categories (4, interval[float64]): [(0.071, 0.28] < (0.28, 0.49] < (0.49, 0.69] < (0.69, 0.9]]

In [ ]:
data = np.random.randn(1000)

In [ ]:
cats = pd.qcut(data, 4)

In [ ]:
cats

[(-0.0334, 0.636], (-0.0334, 0.636], (-0.0334, 0.636], (-0.721, -0.0334], (0.636, 2.687], ..., (-3.08, -0.721], (-0.0334, 0.636], (-3.08, -0.721], (0.636, 2.687], (-3.08, -0.721]]
Length: 1000
Categories (4, interval[float64]): [(-3.08, -0.721] < (-0.721, -0.0334] < (-0.0334, 0.636] <
                                    (0.636, 2.687]]

In [ ]:
pd.value_counts(cats)

(0.636, 2.687]       250
(-0.0334, 0.636]     250
(-0.721, -0.0334]    250
(-3.08, -0.721]      250
dtype: int64

In [ ]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0334, 1.222], (-0.0334, 1.222], (-0.0334, 1.222], (-1.316, -0.0334], (1.222, 2.687], ..., (-1.316, -0.0334], (-0.0334, 1.222], (-3.08, -1.316], (-0.0334, 1.222], (-3.08, -1.316]]
Length: 1000
Categories (4, interval[float64]): [(-3.08, -1.316] < (-1.316, -0.0334] < (-0.0334, 1.222] <
                                    (1.222, 2.687]]

**Detecting and Filtering Outliers**

In [ ]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [ ]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.055113     0.015431     0.002253    -0.026065
std       0.976556     1.024642     0.933600     1.025360
min      -3.199906    -3.170181    -2.919224    -3.768297
25%      -0.598808    -0.649158    -0.663467    -0.722517
50%       0.046373     0.002377     0.017171    -0.018328
75%       0.692076     0.710354     0.620882     0.703199
max       3.195459     3.254121     3.014377     3.386134

In [ ]:
col = data[2]

In [ ]:
col[np.abs(col) > 3]

259    3.014377
Name: 2, dtype: float64

In [ ]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
37   3.195459  0.286969  0.861253 -2.524814
88  -0.325501  0.654327  0.812259  3.004769
131  3.183816 -0.964591 -0.711797  0.216447
141  0.869707  3.254121 -1.184047 -0.122307
223  1.080154 -3.170181  0.686689 -0.396977
259  0.128039 -0.247877  3.014377 -0.755055
352  0.520058  0.207978 -0.218877  3.386134
458 -3.144786 -1.338541  1.086539 -1.332373
490 -3.199906 -1.599284  0.374643  1.123770
647 -0.675376  0.530712  0.461804  3.070036
787 -3.154247  0.012307 -1.746719 -1.547191
940  1.272272  1.404228  0.097037 -3.768297

In [ ]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [ ]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.055233     0.015347     0.002239    -0.025758
std       0.973764     1.023354     0.933553     1.021396
min      -3.000000    -3.000000    -2.919224    -3.000000
25%      -0.598808    -0.649158    -0.663467    -0.722517
50%       0.046373     0.002377     0.017171    -0.018328
75%       0.692076     0.710354     0.620882     0.703199
max       3.000000     3.000000     3.000000     3.000000

In [ ]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0  1.0
1 -1.0  1.0 -1.0 -1.0
2  1.0  1.0 -1.0 -1.0
3  1.0  1.0 -1.0  1.0
4 -1.0  1.0 -1.0  1.0

**Permutation and Random Sampling**

In [ ]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [ ]:
sampler = np.random.permutation(5)

In [ ]:
sampler

array([2, 0, 3, 4, 1])

In [ ]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [ ]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7

In [ ]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19

In [ ]:
choices = pd.Series([5, 7, -1, 6, 4])

In [ ]:
draws = choices.sample(n=10, replace=True)

In [ ]:
draws

4    4
4    4
3    6
3    6
4    4
3    6
0    5
1    7
2   -1
2   -1
dtype: int64

**Computing Indicator/Dummy Variables**

In [ ]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
.....: 'data1': range(6)})

In [ ]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [ ]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [ ]:
df_with_dummy = df[['data1']].join(dummies)

In [ ]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [ ]:
mnames = ['movie_id', 'title', 'genres']

In [ ]:
movies = pd.read_table('/content/sample_data/movies.dat', sep='::',
.....: header=None, names=mnames)

/usr/local/lib/python3.7/dist-packages/pandas/io/parsers.py:767: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return read_csv(**locals())

In [ ]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [ ]:
all_genres = []

In [ ]:
for x in movies.genres:
.....:     all_genres.extend(x.split('|'))

In [ ]:
genres = pd.unique(all_genres)

In [ ]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [ ]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [ ]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [ ]:
gen = movies.genres[0]

In [ ]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [ ]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [ ]:
for i, gen in enumerate(movies.genres):
.....:       indices = dummies.columns.get_indexer(gen.split('|'))
.....:       dummies.iloc[i, indices] = 1
.....:

In [ ]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [ ]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [ ]:
np.random.seed(12345)

In [ ]:
values = np.random.rand(10)

In [ ]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [ ]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [ ]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

**String Manipulation**

**String Object Methods**

In [1]:
val = 'a,b, guido'

In [2]:
val.split(',')

['a', 'b', ' guido']

In [3]:
pieces = [x.strip() for x in val.split(',')]

In [4]:
pieces

['a', 'b', 'guido']

In [5]:
first, second, third = pieces

In [6]:
first + '::' + second + '::' + third

'a::b::guido'

In [7]:
'::'.join(pieces)

'a::b::guido'

In [9]:
'guido' in val

True

In [10]:
val.index(',')

1

In [11]:
val.find(':')

-1

In [12]:
val.index(':')

ValueError: ignored

In [13]:
val.count(',')

2

In [14]:
val.replace(',', '::')

'a::b:: guido'

In [15]:
val.replace(',', '')

'ab guido'

**Regular Expressions**

In [16]:
import re

In [17]:
text = "foo bar\t baz \tqux"

In [18]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [19]:
regex = re.compile('\s+')

In [20]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [21]:
regex.findall(text)

[' ', '\t ', ' \t']

In [22]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [23]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [24]:
m = regex.search(text)

In [25]:
m

In [26]:
text[m.start():m.end()]

'dave@google.com'

In [27]:
print(regex.match(text))

None

In [28]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [29]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [33]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [34]:
m = regex.match('wesm@bright.net')

In [35]:
m.groups()

('wesm', 'bright', 'net')

In [36]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [37]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

**Vectorized String Functions in pandas**

In [41]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
.....:    'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [42]:
data = pd.Series(data)

In [43]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [44]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [45]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [46]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [47]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [48]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [49]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [71]:
#matches.str.get(1)

AttributeError: ignored

In [59]:
#matches.str[0]

AttributeError: ignored

In [60]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object